#include "bank_menu.h"

/* 메뉴 출력 */

void menu() {

    printf("###############################################\n");
    printf("##                                           ##\n");
    printf("##                 ysu_bank                  ##\n");
    printf("##                                           ##\n");
    printf("##                                           ##\n");
    printf("##        1.로그인 2.회원가입 3.종료         ##\n");
    printf("##                                           ##\n");
    printf("###############################################\n");

}

void menu2() {

    printf("################################################################\n");
    printf("##                                                            ##\n");
    printf("##                       ysu_bank                             ##\n");
    printf("##                                                            ##\n");
    printf("##                                                            ##\n");
    printf("##                                                            ##\n");
    printf("##   1.입금 2.출금 3.계좌조회 4.계좌이체 5.로그인창 6.종료    ##\n");
    printf("##                                                            ##\n");
    printf("################################################################\n");

}